v13/flowPastCylinderTurb/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wallsY
    {
        // type            zeroGradient;

        type            fixedValue;
        value           $internalField;

        // type            inletOutlet;
        // inletValue      uniform 0;

        // type            calculated;
        // value           uniform 0;
    }
    wallsZ
    {
        type            empty;
    }
}


// ************************************************************************* //
