v13/flowPastCylinderTurb/system/cutPlane
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            surfaces;
libs            ("libsampling.so");

writeControl    writeTime;

surfaceFormat   vtk;

fields          ( p U mag(U) k epsilon );

interpolationScheme cellPoint;

surfaces
{
    zNormal
    {
        type            cutPlane;
        planeType       pointAndNormal;
        point           (0.50017 0.500317 0);
        normal          (0 0 1);
        interpolate     true;
    }
}


// ************************************************************************* //
