v13/flowPastCylinderTurb/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// #includeFunc cutPlane

#includeFunc vorticity
(
    log=true
)

sphereForce
{
    type            forces;
    libs            ("libforces.so");
    
    enabled         true;   //true or false
    log             true;   //write to screen

    writeControl    writeTime;

    patches     (cylinder); // Names of patches on which to calculate forces
    rhoInf      1.;       // Far field density; e.g., 1.225 kg/m^3 for air
    CofR        (0 0 0);         // Centre of rotation; e.g., (0 0 0)
    // pitchAxis   <pitchAxis>;    // Pitch axis; e.g., (0 1 0)

    rho             rhoInf;
}

// #includeFunc streamlinesLine
// (
//     name=streamlines,
//     start=(-0.0205 0.001 0.00001),
//     end=(-0.0205 0.0251 0.00001),
//     nPoints=10,
//     fields=(p k U)
// )

// ************************************************************************* //
